nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/eiq_examples/mpp/drivers/fsl_ov7670.c
/*! @brief Light mode configuration initialization structure data             */
ov7670_light_mode_config_t OV7670_LIGHT_MODE_DISABLED = {0x05, 0x0a, 0x08, 0x00, 0x08};
ov7670_light_mode_config_t OV7670_LIGHT_MODE_AUTO     = {0xc5, 0x3a, 0x08, 0x00, 0x08};
ov7670_light_mode_config_t OV7670_LIGHT_MODE_SUNNY    = {0xc5, 0x6a, 0x5a, 0x00, 0x5c};
ov7670_light_mode_config_t OV7670_LIGHT_MODE_CLOUDY   = {0xc5, 0x0a, 0x58, 0x00, 0x60};
ov7670_light_mode_config_t OV7670_LIGHT_MODE_OFFICE   = {0xc5, 0x2a, 0x84, 0x00, 0x4c};
ov7670_light_mode_config_t OV7670_LIGHT_MODE_HOME     = {0xc5, 0x1a, 0x96, 0x00, 0x40};

/*! @brief Color saturation configuration initialization structure data       */
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_4PLUS   = {0xc0, 0xc0, 0x00, 0x33, 0x8d, 0xc0, 0x9e, 0x02};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_3PLUS   = {0x99, 0x99, 0x00, 0x28, 0x71, 0x99, 0x9e, 0x02};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_2PLUS   = {0xc0, 0xc0, 0x00, 0x33, 0x8d, 0xc0, 0x9e, 0x00};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_1PLUS   = {0x99, 0x99, 0x00, 0x28, 0x71, 0x99, 0x9e, 0x00};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_0       = {0x80, 0x80, 0x00, 0x22, 0x5e, 0x80, 0x9e, 0x00};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_DEFAULT = {0x40, 0x34, 0x0c, 0x17, 0x29, 0x40, 0x1e, 0x00};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_1MINUS  = {0x66, 0x66, 0x00, 0x1b, 0x4b, 0x66, 0x9e, 0x00};
ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_2MINUS  = {0x40, 0x40, 0x00, 0x11, 0x2f, 0x40, 0x9e, 0x00};

/*! @brief Special effects configuration initialization structure data       */
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_ANTIQUE     = {0x18, 0, 255};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_SEPHIA      = {0x18, 16, 146};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_BLUISH      = {0x18, 240, 146};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_GREENISH    = {0x18, 0, 30};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_REDISH      = {0x18, 90, 240};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_BW          = {0x18, 110, 110};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_NEGATIVE    = {0x28, 0x80, 0x80};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_BW_NEGATIVE = {0x38, 110, 110};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_NORMAL      = {0x0c, 0x80, 0x80};
ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_DISABLED    = {0x08, 0x80, 0x80};

/*! @brief Special effects configuration initialization structure data       */
ov7670_gamma_curve_slope_config_t OV7670_GAMMA_CURVE_SLOPE_DEFAULT = {0x24, 0x04, 0x07, 0x10, 0x28, 0x36, 0x44, 0x52,
                                                                      0x60, 0x6c, 0x78, 0x8c, 0x9e, 0xbb, 0xd2, 0xe5};
ov7670_gamma_curve_slope_config_t OV7670_GAMMA_CURVE_SLOPE1        = {0x20, 0x10, 0x1e, 0x35, 0x5a, 0x69, 0x76, 0x80,
                                                               0x88, 0x8f, 0x96, 0xa3, 0xaf, 0xc4, 0xd7, 0xe8};

const camera_device_operations_t ov7670_ops = {
    .init     = OV7670_Init,
    .deinit   = OV7670_Deinit,
    .start    = OV7670_Start,
    .stop     = OV7670_Stop,
    .control  = OV7670_Control,
    .init_ext = OV7670_InitExt,
};
/*******************************************************************************
 * Code
 ******************************************************************************/

static void OV7670_DelayMs(uint32_t ms)
{
    VIDEO_DelayMs(ms);
}

status_t OV7670_CameraInit(camera_device_handle_t *handle, const ov7670_config_t *config)
{
    uint8_t u8TempVal0, u8TempVal1;

    /* Reset Device */
    (void)OV7670_WriteReg(handle, OV7670_COM7_REG, 0x80);
    /* wait for a least 1ms */
    OV7670_DelayMs(5); /* 5ms */

    /* Read product ID nuumber MSB */
    if (OV7670_ReadReg(handle, OV7670_PID_REG, &u8TempVal0) != kStatus_Success)
    {
        return kStatus_Fail;
    }
    /* Read product ID nuumber MSB */
    if (OV7670_ReadReg(handle, OV7670_VER_REG, &u8TempVal1) != kStatus_Success)
    {
        return kStatus_Fail;
    }
    if ((u8TempVal0 != OV7670_PID_NUM) && (u8TempVal1 != OV7670_VER_NUM))
    {
        return kStatus_Fail;
    }

    /* NULL pointer means default setting. */
    if (config == NULL)
    {
        /* Reset Device */
        (void)OV7670_WriteReg(handle, OV7670_COM7_REG, 0x80);
        /* wait for a bit */
        OV7670_DelayMs(5); /* 5ms */
    }
    else
    {
        (void)OV7670_Configure(handle, config);
    }
	
    /* MVFP */
    if (OV7670_ReadReg(handle, OV7670_MVFP_REG, &u8TempVal1) != kStatus_Success)
    {
        return kStatus_Fail;
    }
    if (0U == (u8TempVal1 & OV7670_MVFP_MIRROR_MASK))
    {
        u8TempVal1 |= OV7670_MVFP_MIRROR_MASK;
        (void)OV7670_WriteReg(handle, OV7670_MVFP_REG, u8TempVal1);
    }
    return kStatus_Success;
}

status_t OV7670_ContrastAdjustment(camera_device_handle_t *handle, uint8_t val)
{
    status_t status = kStatus_Success;

    status = OV7670_WriteReg(handle, OV7670_CONTRAS_CENTER_REG, 0x80);
    status = OV7670_ModifyReg(handle, OV7670_MTXS_REG, 0x80, 0x00);
    status = OV7670_WriteReg(handle, OV7670_CONTRAS_REG, val);
    return status;
}

status_t OV7670_BrightnessAdjustment(camera_device_handle_t *handle, uint8_t val)
{
    status_t status = kStatus_Success;

    status = OV7670_WriteReg(handle, OV7670_BRIGHT_REG, val);

    return status;
}

status_t OV7670_Configure(camera_device_handle_t *handle, const ov7670_config_t *config)
{
    status_t status = kStatus_Success;

    ov7670_windowing_config_t *windowConfig;
    (void)OV7670_OutputFormat(handle, config->outputFormat);
    (void)OV7670_Resolution(handle, config->resolution);

    switch ((video_resolution_t)config->resolution)
    {
        case kVIDEO_ResolutionVGA:
            windowConfig = (ov7670_windowing_config_t *)&OV7670_WINDOW_VGA;
            break;
        case kVIDEO_ResolutionQVGA:
            windowConfig = (ov7670_windowing_config_t *)&OV7670_WINDOW_QVGA;
            break;
        case kVIDEO_ResolutionQQVGA:
            windowConfig = (ov7670_windowing_config_t *)&OV7670_WINDOW_QQVGA;
            break;
        case kVIDEO_ResolutionCIF:
            windowConfig = (ov7670_windowing_config_t *)&OV7670_WINDOW_CIF;
            break;
        case kVIDEO_ResolutionQCIF:
            windowConfig = (ov7670_windowing_config_t *)&OV7670_WINDOW_QCIF;
            break;
        case kVIDEO_ResolutionQQCIF:
            windowConfig = (ov7670_windowing_config_t *)&OV7670_WINDOW_QQCIF;
            break;
        default:
            status = kStatus_Fail; /* not supported resolution */
            break;
    }

    if (kStatus_Success != status)
    {
        return status;
    }

    (void)OV7670_SetWindow(handle, windowConfig);
    (void)OV7670_FrameRateAdjustment(handle, config->frameRate);

    if (config->advancedConfig == NULL)
    {
        (void)OV7670_BandingFilterSelection(handle, (ov7670_filter_config_t *)&OV7670_FILTER_25FPS_50HZ);
        (void)OV7670_NightMode(handle, (ov7670_night_mode_config_t *)&OV7670_NIGHT_MODE_DISABLED);
        (void)OV7670_WhiteBalance(handle, (ov7670_white_balance_config_t *)&OV7670_WHITE_BALANCE_SIMPLE);
        (void)OV7670_LightMode(handle, (ov7670_light_mode_config_t *)&OV7670_LIGHT_MODE_DISABLED);
        (void)OV7670_ColorSaturation(handle, (ov7670_color_saturation_config_t *)&OV7670_COLOR_SATURATION_2PLUS);
        (void)OV7670_SpecialEffects(handle, (ov7670_special_effect_config_t *)&OV7670_SPECIAL_EFFECT_DISABLED);
        (void)OV7670_GammaCurveSlope(handle, (ov7670_gamma_curve_slope_config_t *)&OV7670_GAMMA_CURVE_SLOPE_DEFAULT);
    }
    else
    {
        (void)OV7670_BandingFilterSelection(handle, config->advancedConfig->filter);
        (void)OV7670_NightMode(handle, config->advancedConfig->nightMode);
        (void)OV7670_WhiteBalance(handle, config->advancedConfig->whiteBalance);
        (void)OV7670_LightMode(handle, config->advancedConfig->lightMode);
        (void)OV7670_ColorSaturation(handle, config->advancedConfig->colorSaturation);
        (void)OV7670_SpecialEffects(handle, config->advancedConfig->specialEffect);
        (void)OV7670_GammaCurveSlope(handle, config->advancedConfig->gammaCurveSlope);
    }

    (void)OV7670_ContrastAdjustment(handle, config->contrast);
    (void)OV7670_BrightnessAdjustment(handle, config->brightness);
    (void)OV7670_WriteReg(handle, 0xb0, 0x84); /*!< because of colors */
    (void)OV7670_WriteReg(handle, 0xff, 0xff);

    return kStatus_Success;
}

status_t OV7670_OutputFormat(camera_device_handle_t *handle, const ov7670_output_format_config_t *outputFormatConfig)
{
    (void)OV7670_ModifyReg(handle, OV7670_COM7_REG, 0x05, outputFormatConfig->com7);
    (void)OV7670_ModifyReg(handle, OV7670_RGB444_REG, 0x03, outputFormatConfig->rgb444);
    (void)OV7670_ModifyReg(handle, OV7670_COM15_REG, 0x30, outputFormatConfig->com15);

    return kStatus_Success;
}

status_t OV7670_Resolution(camera_device_handle_t *handle, uint32_t resolution)
{
    status_t status = kStatus_Success;

    ov7670_resolution_config_t *resolution_config;
    switch ((video_resolution_t)resolution)
    {
        case kVIDEO_ResolutionVGA:
            resolution_config = (ov7670_resolution_config_t *)&OV7670_RESOLUTION_VGA;
            break;
        case kVIDEO_ResolutionQVGA:
            resolution_config = (ov7670_resolution_config_t *)&OV7670_RESOLUTION_QVGA;
            break;
        case kVIDEO_ResolutionQQVGA:
            resolution_config = (ov7670_resolution_config_t *)&OV7670_RESOLUTION_QQVGA;
            break;
        case kVIDEO_ResolutionCIF:
            resolution_config = (ov7670_resolution_config_t *)&OV7670_RESOLUTION_CIF;
            break;
        case kVIDEO_ResolutionQCIF:
            resolution_config = (ov7670_resolution_config_t *)&OV7670_RESOLUTION_QCIF;
            break;
        case kVIDEO_ResolutionQQCIF:
            resolution_config = (ov7670_resolution_config_t *)&OV7670_RESOLUTION_QQCIF;
            break;
        default:
            status = kStatus_Fail; /*!< not supported resolution */
            break;
    }

    if (kStatus_Success != status)
    {
        return status;
    }

    (void)OV7670_ModifyReg(handle, OV7670_COM7_REG, 0x38, resolution_config->com7);
    (void)OV7670_ModifyReg(handle, OV7670_COM3_REG, 0x0c, resolution_config->com3);
    (void)OV7670_WriteReg(handle, OV7670_COM14_REG, resolution_config->com14);
    (void)OV7670_WriteReg(handle, OV7670_SCALING_XSC_REG, resolution_config->scalingXsc);
    (void)OV7670_WriteReg(handle, OV7670_SCALING_YSC_REG, resolution_config->scalingYsc);
    (void)OV7670_ModifyReg(handle, OV7670_SCALING_DCWCTR_REG, 0x33, resolution_config->scalingDcwctr);
    (void)OV7670_WriteReg(handle, OV7670_SCALING_PCLK_DIV_REG, resolution_config->scalingPclkDiv);
    (void)OV7670_WriteReg(handle, OV7670_SCALING_PCLK_DELAY_REG, resolution_config->scalingPclkDelay);

    /* Autotomatically set output window after resolution change                */
    (void)OV7670_ModifyReg(handle, OV7670_TSLB_REG, 0x01, 0x01);

    return kStatus_Success;
}

status_t OV7670_SetWindow(camera_device_handle_t *handle, const ov7670_windowing_config_t *windowingConfig)
{
    (void)OV7670_ModifyReg(handle, OV7670_TSLB_REG, 0x01, 0x00);

    (void)OV7670_WriteReg(handle, OV7670_HREF_REG, windowingConfig->href);
    (void)OV7670_WriteReg(handle, OV7670_HSTART_REG, windowingConfig->hstart);
    (void)OV7670_WriteReg(handle, OV7670_HSTOP_REG, windowingConfig->hstop);
    (void)OV7670_WriteReg(handle, OV7670_VREF_REG, windowingConfig->vref);
    (void)OV7670_WriteReg(handle, OV7670_VSTART_REG, windowingConfig->vstart);
    (void)OV7670_WriteReg(handle, OV7670_VSTOP_REG, windowingConfig->vstop);

    return kStatus_Success;
}

status_t OV7670_FrameRateAdjustment(camera_device_handle_t *handle, const ov7670_frame_rate_config_t *frameRateConfig)
{
    (void)OV7670_WriteReg(handle, OV7670_CLKRC_REG, frameRateConfig->clkrc);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_DBLV_REG, frameRateConfig->dblv);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_EXHCH_REG, frameRateConfig->exhch);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_EXHCL_REG, frameRateConfig->exhcl);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_DM_LNL_REG, frameRateConfig->dm_lnl);
    OV7670_DelayMs(2);
    //(void)OV7670_WriteReg(handle, OV7670_DM_LNH_REG, frameRateConfig->dm_lnh);
	(void)OV7670_WriteReg(handle, OV7670_DM_LNL_REG, frameRateConfig->dm_lnh);
    OV7670_DelayMs(2);

    return kStatus_Success;
}

