nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/eiq_examples/mpp/drivers/fsl_ov7670.c
status_t OV7670_NightMode(camera_device_handle_t *handle, const ov7670_night_mode_config_t *nightModeConfig)
{
    (void)OV7670_ModifyReg(handle, OV7670_COM11_REG, 0xe0, nightModeConfig->com11);

    OV7670_DelayMs(2);

    return kStatus_Success;
}

status_t OV7670_BandingFilterSelection(camera_device_handle_t *handle, const ov7670_filter_config_t *filterConfig)
{
    (void)OV7670_WriteReg(handle, OV7670_BD50ST_REG, filterConfig->bd50st);      /*!< 50Hz banding filter */
    (void)OV7670_WriteReg(handle, OV7670_BD60ST_REG, filterConfig->bd60st);      /*!< 60Hz banding filter */
    (void)OV7670_WriteReg(handle, OV7670_BD50MAX_REG, filterConfig->bd50max);    /*!< x step for 50hz */
    (void)OV7670_WriteReg(handle, OV7670_BD60MAX_REG, filterConfig->bd60max);    /*!< y step for 60hz */
    (void)OV7670_ModifyReg(handle, OV7670_COM11_REG, 0x1a, filterConfig->com11); /*!< Automatic Detect banding filter */
    (void)OV7670_ModifyReg(handle, OV7670_COM8_REG, 0x20, filterConfig->com8);   /*!< banding filter enable */

    return kStatus_Success;
}

status_t OV7670_WhiteBalance(camera_device_handle_t *handle, const ov7670_white_balance_config_t *whiteBalanceConfig)
{
    (void)OV7670_ModifyReg(handle, OV7670_COM8_REG, 0x02, whiteBalanceConfig->com8); /*!< AWB on/off  */
    (void)OV7670_WriteReg(handle, OV7670_AWBCTR0_REG, whiteBalanceConfig->awbctr0);
    (void)OV7670_WriteReg(handle, OV7670_AWBCTR1_REG, whiteBalanceConfig->awbctr1);
    (void)OV7670_WriteReg(handle, OV7670_AWBCTR2_REG, whiteBalanceConfig->awbctr2);
    (void)OV7670_WriteReg(handle, OV7670_AWBCTR3_REG, whiteBalanceConfig->awbctr3);
    (void)OV7670_WriteReg(handle, OV7670_AWBC1_REG, whiteBalanceConfig->awbc1);
    (void)OV7670_WriteReg(handle, OV7670_AWBC2_REG, whiteBalanceConfig->awbc2);
    (void)OV7670_WriteReg(handle, OV7670_AWBC3_REG, whiteBalanceConfig->awbc3);
    (void)OV7670_WriteReg(handle, OV7670_AWBC4_REG, whiteBalanceConfig->awbc4);
    (void)OV7670_WriteReg(handle, OV7670_AWBC5_REG, whiteBalanceConfig->awbc5);
    (void)OV7670_WriteReg(handle, OV7670_AWBC6_REG, whiteBalanceConfig->awbc6);
    (void)OV7670_WriteReg(handle, 0x59, 0x91);
    (void)OV7670_WriteReg(handle, 0x5a, 0x94);
    (void)OV7670_WriteReg(handle, 0x5b, 0xaa);
    (void)OV7670_WriteReg(handle, 0x5c, 0x71);
    (void)OV7670_WriteReg(handle, 0x5d, 0x8d);
    (void)OV7670_WriteReg(handle, 0x5e, 0x0f);
    (void)OV7670_WriteReg(handle, 0x5f, 0xf0);
    (void)OV7670_WriteReg(handle, 0x60, 0xf0);
    (void)OV7670_WriteReg(handle, 0x61, 0xf0);
    (void)OV7670_ModifyReg(handle, OV7670_COM16_REG, 0x08, whiteBalanceConfig->com16); /*!< AWB gain on */

    return kStatus_Success;
}

status_t OV7670_LightMode(camera_device_handle_t *handle, const ov7670_light_mode_config_t *lightModeConfig)
{
    (void)OV7670_ModifyReg(handle, OV7670_COM8_REG, 0xc5, lightModeConfig->com8);
    (void)OV7670_ModifyReg(handle, OV7670_COM9_REG, 0x7a, lightModeConfig->com9);
    (void)OV7670_WriteReg(handle, OV7670_RED_REG, lightModeConfig->red);
    (void)OV7670_WriteReg(handle, OV7670_GGAIN_REG, lightModeConfig->green);
    (void)OV7670_WriteReg(handle, OV7670_BLUE_REG, lightModeConfig->blue);
    (void)OV7670_WriteReg(handle, OV7670_GAIN_REG, 0x00);
    OV7670_DelayMs(2);

    /*!< Exposure value */
    (void)OV7670_WriteReg(handle, OV7670_AECH_REG, 0x00);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_AECHH_REG, 0x00);
    OV7670_DelayMs(2);
    (void)OV7670_ModifyReg(handle, OV7670_COM1_REG, 0x3, 0x00);
    OV7670_DelayMs(2);
    /*!< AGC/AEC stable operation region configuration */
    (void)OV7670_WriteReg(handle, OV7670_AEW_REG, 0x75);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_AEB_REG, 0x63);
    OV7670_DelayMs(2);
    (void)OV7670_WriteReg(handle, OV7670_VPT_REG, 0xd4);
    OV7670_DelayMs(2);

    return kStatus_Success;
}

status_t OV7670_ColorSaturation(camera_device_handle_t *handle,
                                const ov7670_color_saturation_config_t *colorSaturationConfig)
{
    (void)OV7670_WriteReg(handle, OV7670_MTX1_REG, colorSaturationConfig->mtx1);
    (void)OV7670_WriteReg(handle, OV7670_MTX2_REG, colorSaturationConfig->mtx2);
    (void)OV7670_WriteReg(handle, OV7670_MTX3_REG, colorSaturationConfig->mtx3);
    (void)OV7670_WriteReg(handle, OV7670_MTX4_REG, colorSaturationConfig->mtx4);
    (void)OV7670_WriteReg(handle, OV7670_MTX5_REG, colorSaturationConfig->mtx5);
    (void)OV7670_WriteReg(handle, OV7670_MTX6_REG, colorSaturationConfig->mtx6);
    (void)OV7670_WriteReg(handle, OV7670_MTXS_REG, colorSaturationConfig->mtxs);
    (void)OV7670_ModifyReg(handle, OV7670_COM16_REG, 0x02, colorSaturationConfig->com16);

    return kStatus_Success;
}

status_t OV7670_SpecialEffects(camera_device_handle_t *handle,
                               const ov7670_special_effect_config_t *specialEffectConfig)
{
    (void)OV7670_ModifyReg(handle, OV7670_TSLB_REG, 0xfe, specialEffectConfig->tslb);
    (void)OV7670_WriteReg(handle, OV7670_MANU_REG, specialEffectConfig->manu);
    (void)OV7670_WriteReg(handle, OV7670_MANV_REG, specialEffectConfig->manv);

    return kStatus_Success;
}

status_t OV7670_SetWindowByCoordinates(camera_device_handle_t *handle,
                                       ov7670_window_start_point_t *startPoint,
                                       uint32_t resolution)
{
    uint16_t u16Temp, u16Href, u16Vref;

    (void)OV7670_ModifyReg(handle, OV7670_TSLB_REG, 0x01, 0x00);

    u16Temp = startPoint->hstartCoordinate + FSL_VIDEO_EXTRACT_WIDTH(resolution);
    u16Href = (u16Temp & 0x07U);
    u16Href = u16Href << 3;
    u16Href |= (startPoint->hstartCoordinate & 0x07U);
    u16Href |= 0xc0U;
    (void)OV7670_WriteReg(handle, OV7670_HREF_REG, (uint8_t)u16Href);
    u16Temp = u16Temp >> 3;
    (void)OV7670_WriteReg(handle, OV7670_HSTOP_REG, (uint8_t)u16Temp);
    u16Temp = ((startPoint->hstartCoordinate & 0x7f8U) >> 3);
    (void)OV7670_WriteReg(handle, OV7670_HSTART_REG, (uint8_t)u16Temp);

    u16Temp = startPoint->vstartCoordinate + FSL_VIDEO_EXTRACT_HEIGHT(resolution);
    u16Vref = (u16Temp & 0x03U);
    u16Vref = u16Vref << 2;
    u16Vref |= (startPoint->vstartCoordinate & 0x03U);
    u16Vref &= 0xF0U;
    (void)OV7670_ModifyReg(handle, OV7670_VREF_REG, 0xc0, (uint8_t)u16Vref);
    u16Temp = u16Temp >> 2;
    (void)OV7670_WriteReg(handle, OV7670_VSTOP_REG, (uint8_t)u16Temp);
    u16Temp = ((startPoint->vstartCoordinate & 0x3fcU) >> 2);
    (void)OV7670_WriteReg(handle, OV7670_VSTART_REG, (uint8_t)u16Temp);

    return kStatus_Success;
}

status_t OV7670_GammaCurveSlope(camera_device_handle_t *handle,
                                const ov7670_gamma_curve_slope_config_t *gammaCurveSlopeConfig)
{
    (void)OV7670_WriteReg(handle, OV7670_SLOP_REG, gammaCurveSlopeConfig->slope);
    (void)OV7670_WriteReg(handle, OV7670_GAM1_REG, gammaCurveSlopeConfig->gam1);
    (void)OV7670_WriteReg(handle, OV7670_GAM2_REG, gammaCurveSlopeConfig->gam2);
    (void)OV7670_WriteReg(handle, OV7670_GAM3_REG, gammaCurveSlopeConfig->gam3);
    (void)OV7670_WriteReg(handle, OV7670_GAM4_REG, gammaCurveSlopeConfig->gam4);
    (void)OV7670_WriteReg(handle, OV7670_GAM5_REG, gammaCurveSlopeConfig->gam5);
    (void)OV7670_WriteReg(handle, OV7670_GAM6_REG, gammaCurveSlopeConfig->gam6);
    (void)OV7670_WriteReg(handle, OV7670_GAM7_REG, gammaCurveSlopeConfig->gam7);
    (void)OV7670_WriteReg(handle, OV7670_GAM8_REG, gammaCurveSlopeConfig->gam8);
    (void)OV7670_WriteReg(handle, OV7670_GAM9_REG, gammaCurveSlopeConfig->gam9);
    (void)OV7670_WriteReg(handle, OV7670_GAM10_REG, gammaCurveSlopeConfig->gam10);
    (void)OV7670_WriteReg(handle, OV7670_GAM11_REG, gammaCurveSlopeConfig->gam11);
    (void)OV7670_WriteReg(handle, OV7670_GAM12_REG, gammaCurveSlopeConfig->gam12);
    (void)OV7670_WriteReg(handle, OV7670_GAM13_REG, gammaCurveSlopeConfig->gam13);
    (void)OV7670_WriteReg(handle, OV7670_GAM14_REG, gammaCurveSlopeConfig->gam14);
    (void)OV7670_WriteReg(handle, OV7670_GAM15_REG, gammaCurveSlopeConfig->gam15);

    return kStatus_Success;
}

void OV7670_GetDefaultConfig(ov7670_config_t *config)
{
    config->outputFormat   = (ov7670_output_format_config_t *)&OV7670_FORMAT_RGB565;
    config->resolution     = (uint32_t)kVIDEO_ResolutionQQVGA;
    config->frameRate      = (ov7670_frame_rate_config_t *)&OV7670_25FPS_12MHZ_XCLK;
    config->contrast       = 0x30;
    config->brightness     = 0x10;
    config->advancedConfig = NULL;
}

status_t OV7670_Init(camera_device_handle_t *handle, const camera_config_t *config)
{
    status_t status;
    ov7670_resource_t *resource = (ov7670_resource_t *)(handle->resource);
    ov7670_config_t cameraConfig;

    if ((kVIDEO_PixelFormatYUYV != config->pixelFormat) && (kVIDEO_PixelFormatRGB565 != config->pixelFormat) &&
        (kVIDEO_PixelFormatRGBX4444 != config->pixelFormat) && (kVIDEO_PixelFormatXRGB4444 != config->pixelFormat) &&
        (kVIDEO_PixelFormatXRGB1555 != config->pixelFormat))
    {
        return kStatus_InvalidArgument;
    }

    if ((15U != config->framePerSec) && (30U != config->framePerSec) && (25U != config->framePerSec) &&
        (14U != config->framePerSec))
    {
        return kStatus_InvalidArgument;
    }

    if ((kCAMERA_InterfaceNonGatedClock != config->interface) && (kCAMERA_InterfaceGatedClock != config->interface))
    {
        return kStatus_InvalidArgument;
    }

