nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/eiq_examples/mpp/drivers/fsl_ov7670.c
    OV7670_GetDefaultConfig(&cameraConfig);
    cameraConfig.resolution = config->resolution;
    switch (resource->xclock)
    {
        case kOV7670_InputClock24MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_24MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_24MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_24MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_24MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        case kOV7670_InputClock12MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_12MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_12MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_12MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_12MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        case kOV7670_InputClock26MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_26MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_26MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_26MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_26MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        case kOV7670_InputClock13MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_13MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_13MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_13MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_13MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        default:
            assert(false);
            break;
    }

    switch (config->pixelFormat)
    {
        case kVIDEO_PixelFormatYUYV:
            cameraConfig.outputFormat = &OV7670_FORMAT_YUV422;
            break;

        case kVIDEO_PixelFormatXRGB1555:
            cameraConfig.outputFormat = &OV7670_FORMAT_RGB555;
            break;

        case kVIDEO_PixelFormatRGBX4444:
            cameraConfig.outputFormat = &OV7670_FORMAT_RGBx444;
            break;

        case kVIDEO_PixelFormatXRGB4444:
            cameraConfig.outputFormat = &OV7670_FORMAT_xRGB444;
            break;

        case kVIDEO_PixelFormatRGB565:
        default:
            cameraConfig.outputFormat = &OV7670_FORMAT_RGB565;
            break;
    }

    do
    {
        status = OV7670_CameraInit(handle, &cameraConfig);
    } while (status != kStatus_Success);

    return status;
}

status_t OV7670_Deinit(camera_device_handle_t *handle)
{
    return kStatus_Success;
}

status_t OV7670_Start(camera_device_handle_t *handle)
{
    return kStatus_Success;
}

status_t OV7670_Stop(camera_device_handle_t *handle)
{
    return kStatus_Success;
}

status_t OV7670_InitExt(camera_device_handle_t *handle, const camera_config_t *config, const void *specialConfig)
{
    return OV7670_Init(handle, config);
}

status_t OV7670_Control(camera_device_handle_t *handle, camera_device_cmd_t cmd, int32_t arg)
{
    return kStatus_InvalidArgument;
}
